---
kind: property
id: P:Autodesk.Revit.DB.Lighting.InitialIntensity.InitialIntensityValue
source: html/02ef1e1a-f3a8-9e10-cd1b-8bdaa5a63720.htm
---
# Autodesk.Revit.DB.Lighting.InitialIntensity.InitialIntensityValue Property

The calculated initial intensity value.

## Syntax (C#)
```csharp
public double InitialIntensityValue { get; }
```